# Data Preprocessing
* I. Missing Value
* II. apply( )
* III. Filtering
* IV. 데이터프레임 합치기
* V. 그룹 연산
* VI. Multi-Index
* VII. pivot_table( )

#  1, Missing Value(결측치)

## 1) 실습용 'titanic' 데이터셋

### 'age'및 'deck' 열에서 결측치(NaN)확인

In [ ]:
import seaborn as sns
DF = sns.load_dataset('titanic')

DF.head(10)

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True
3         1       1  female  35.0  ...     C  Southampton    yes  False
4         0       3    male  35.0  ...   NaN  Southampton     no   True
5         0       3    male   NaN  ...   NaN   Queenstown     no   True
6         0       1    male  54.0  ...     E  Southampton     no   True
7         0       3    male   2.0  ...   NaN  Southampton     no  False
8         1       3  female  27.0  ...   NaN  Southampton    yes  False
9         1       2  female  14.0  ...   NaN    Cherbourg    yes  False

[10 rows x 15 columns]

In [ ]:
DF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB

## 2) 결측치 확인

### .value_counts(dropna = False)

#### 결측치를 포함하여 결과 출력

In [ ]:
DF['deck'].value_counts(dropna=False)

NaN    688
C       59
B       47
D       33
E       32
A       15
F       13
G        4
Name: deck, dtype: int64

### .isnull()

#### 결측치(NAN)를 'True'로 출력

In [ ]:
DF.head(10).isnull()

   survived  pclass    sex    age  ...   deck  embark_town  alive  alone
0     False   False  False  False  ...   True        False  False  False
1     False   False  False  False  ...  False        False  False  False
2     False   False  False  False  ...   True        False  False  False
3     False   False  False  False  ...  False        False  False  False
4     False   False  False  False  ...   True        False  False  False
5     False   False  False   True  ...   True        False  False  False
6     False   False  False  False  ...  False        False  False  False
7     False   False  False  False  ...   True        False  False  False
8     False   False  False  False  ...   True        False  False  False
9     False   False  False  False  ...   True        False  False  False

[10 rows x 15 columns]

### .isnull().sum(axis=0)

#### 각 열별로 결측치 개수 확인

In [ ]:
DF.isnull().sum(axis=0)

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

### .notnull()

####   결측치를 'False'로 출력

In [ ]:
DF.head(10).notnull()

   survived  pclass   sex    age  ...   deck  embark_town  alive  alone
0      True    True  True   True  ...  False         True   True   True
1      True    True  True   True  ...   True         True   True   True
2      True    True  True   True  ...  False         True   True   True
3      True    True  True   True  ...   True         True   True   True
4      True    True  True   True  ...  False         True   True   True
5      True    True  True  False  ...  False         True   True   True
6      True    True  True   True  ...   True         True   True   True
7      True    True  True   True  ...  False         True   True   True
8      True    True  True   True  ...  False         True   True   True
9      True    True  True   True  ...  False         True   True   True

[10 rows x 15 columns]

In [ ]:
DF.notnull().sum(axis=0)

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

## 3) 결측치 삭제

### 결측치가 300개 이상인 열 삭제

#### .dropna(thresh = 300, axis =1)

In [ ]:
DF.isnull().sum(axis = 0)

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [ ]:
DF.dropna(thresh=300, axis = 1).shape

(891, 14)

#### .dropna(subset=['age'], how = 'any', axis = 0)

In [ ]:
DF.shape

(891, 15)

In [ ]:
DF.dropna(subset=['age'], how='any', axis=0).shape

(714, 15)

In [ ]:
DF.dropna(subset=['age','deck'], how='any', axis=0).shape

(184, 15)

## 4) 격측치 치환

### 연속형 데이터 치환

#### .fillna(int(DF['age'].mean(axis = 0)), inplace = True)

In [ ]:
DF['age'].head(10)

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: age, dtype: float64

In [ ]:
DF['age'].fillna(int(DF['age'].mean(axis=0)), inplace=True)

In [ ]:
DF['age'].head(10)

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5    29.0
6    54.0
7     2.0
8    27.0
9    14.0
Name: age, dtype: float64

### 명목형 데이터 치환

#### .fillna(most_freq, inplace=True)

In [ ]:
DF['embark_town'][825:830]

825     Queenstown
826    Southampton
827      Cherbourg
828     Queenstown
829            NaN
Name: embark_town, dtype: object

In [ ]:
most_freq = DF['embark_town'].value_counts(dropna=True)
most_freq

Southampton    644
Cherbourg      168
Queenstown      77
Name: embark_town, dtype: int64

In [ ]:
most_freq = DF['embark_town'].value_counts(dropna=False)
most_freq

Southampton    644
Cherbourg      168
Queenstown      77
NaN              2
Name: embark_town, dtype: int64

In [ ]:
most_freq = DF['embark_town'].value_counts(dropna=True).idxmax()
most_freq

'Southampton'

In [ ]:
DF['embark_town'].fillna(most_freq, inplace=True)

In [ ]:
DF['embark_town'][825:830]

825     Queenstown
826    Southampton
827      Cherbourg
828     Queenstown
829    Southampton
Name: embark_town, dtype: object

### 결측치 치환

#### .fillna(method='ffill'/'bfill', inplace=True)

In [ ]:
DF= sns.load_dataset('titanic')

In [ ]:
DF['embark_town'][828:831]

828    Queenstown
829           NaN
830     Cherbourg
Name: embark_town, dtype: object

In [ ]:
DF['embark_town'].fillna(method='ffill', inplace=True)
DF['embark_town'][828:831]

828    Queenstown
829    Queenstown
830     Cherbourg
Name: embark_town, dtype: object

In [ ]:
DF= sns.load_dataset('titanic')

In [ ]:
DF['embark_town'].fillna(method='bfill', inplace=True)
DF['embark_town'][828:831]

828    Queenstown
829     Cherbourg
830     Cherbourg
Name: embark_town, dtype: object

In [ ]:
print(type(DF['embark_town']))

<class 'pandas.core.series.Series'>

# 2, apply() <p> - 시리즈나 데이터프레임 구조에 함수를 매핑

## 1) 실습용 'titanic' 데이터 셋 <p> DF = titanic.loc[ : , [ 'age' , 'fare' ]].head(5)

In [ ]:
import seaborn as sns
titanic = sns.load_dataset('titanic')

DF=titanic.loc[:,['age','fare']].head(5)
DF

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

## 2) apply(axis = 0) <p> - sum() 함수를 행 방향으로 매핑

In [ ]:
DF.apply(sum, axis = 0)

age     156.0000
fare    147.6083
dtype: float64

In [ ]:
DF.sum(axis = 0)

age     156.0000
fare    147.6083
dtype: float64

In [ ]:
DF.apply(sum, axis=1)

0     29.2500
1    109.2833
2     33.9250
3     88.1000
4     43.0500
dtype: float64

In [ ]:
DF.sum(axis=1)

0     29.2500
1    109.2833
2     33.9250
3     88.1000
4     43.0500
dtype: float64

# 3, Filtering

## 1) 실습용 'titanic' 데이터 셋

## 2) 'age'가 10살 이상이면서 20살 미만

In [ ]:
'''import seaborn as sns
titanic = sns.load_dataset('titanic')

titanic.head(3)'''

import pandas as pd
titanic = pd.read_csv('titanic.csv')
titanic.head(3)

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True

[3 rows x 15 columns]

In [ ]:
Filter_1 = (titanic.age>=10) & (titanic.age<20)
titanic.loc[Filter_1,:].head()

    survived  pclass     sex   age  ...  deck  embark_town  alive  alone
9          1       2  female  14.0  ...   NaN    Cherbourg    yes  False
14         0       3  female  14.0  ...   NaN  Southampton     no   True
22         1       3  female  15.0  ...   NaN   Queenstown    yes   True
27         0       1    male  19.0  ...     C  Southampton     no  False
38         0       3  female  18.0  ...   NaN  Southampton     no  False

[5 rows x 15 columns]

## 3) 'age'가 10살 미만이면서 'sex'이 여자

In [ ]:
Filter_2 = (titanic.age<10) & (titanic.sex=='female')
titanic.loc[Filter_2,:].head(3)

    survived  pclass     sex  age  ...  deck  embark_town  alive  alone
10         1       3  female  4.0  ...     G  Southampton    yes  False
24         0       3  female  8.0  ...   NaN  Southampton     no  False
43         1       2  female  3.0  ...   NaN    Cherbourg    yes  False

[3 rows x 15 columns]

## 4) 'age'가 10살 미만, 또는 60살 이상

In [ ]:
Filter_3 = (titanic.age <10) | (titanic.age>=60)
titanic.loc[Filter_3,['age','sex','alone']].head()

     age     sex  alone
7    2.0    male  False
10   4.0  female  False
16   2.0    male  False
24   8.0  female  False
33  66.0    male   True

## 5) isin()

In [ ]:
Filter_isin = titanic['sibsp'].isin([3,4,5])
titanic[Filter_isin].head(6)

    survived  pclass     sex   age  ...  deck  embark_town  alive  alone
7          0       3    male   2.0  ...   NaN  Southampton     no  False
16         0       3    male   2.0  ...   NaN   Queenstown     no  False
24         0       3  female   8.0  ...   NaN  Southampton     no  False
27         0       1    male  19.0  ...     C  Southampton     no  False
50         0       3    male   7.0  ...   NaN  Southampton     no  False
59         0       3    male  11.0  ...   NaN  Southampton     no  False

[6 rows x 15 columns]

In [ ]:
Filter_isin_1 = titanic['age'].isin([20,30,40])
titanic.loc[Filter_isin_1,:].head(10)

     survived  pclass     sex   age  ...  deck  embark_town  alive  alone
12          0       3    male  20.0  ...   NaN  Southampton     no   True
30          0       1    male  40.0  ...   NaN    Cherbourg     no   True
40          0       3  female  40.0  ...   NaN  Southampton     no  False
79          1       3  female  30.0  ...   NaN  Southampton    yes   True
91          0       3    male  20.0  ...   NaN  Southampton     no   True
113         0       3  female  20.0  ...   NaN  Southampton     no  False
131         0       3    male  20.0  ...   NaN  Southampton     no   True
157         0       3    male  30.0  ...   NaN  Southampton     no   True
161         1       2  female  40.0  ...   NaN  Southampton    yes   True
178         0       2    male  30.0  ...   NaN  Southampton     no   True

[10 rows x 15 columns]

# 4, 데이터프레임 합치기

## 1) 데이터프레임 DF1, DF2 생성

In [ ]:
import pandas as pd

DF1= pd.DataFrame({'hp':['hp0','hp1','hp2'],
                   'IBM':['IBM0','IBM1','IBM2'],
                   'DELL':['DELL0','DELL1','DELL2']},
                  index=[0,1,2])
DF1

    hp   IBM   DELL
0  hp0  IBM0  DELL0
1  hp1  IBM1  DELL1
2  hp2  IBM2  DELL2

In [ ]:
DF2= pd.DataFrame({'hp':['hp2','hp3','hp4'],
                   'IBM':['IBM2','IBM3','IBM4'],
                   'DELL':['DELL2','DELL3','DELL4'],
                  'ASUS':['ASUS2','ASUS3','ASUS4']},
                  index=[2,3,4])
DF2

    hp   IBM   DELL   ASUS
2  hp2  IBM2  DELL2  ASUS2
3  hp3  IBM3  DELL3  ASUS3
4  hp4  IBM4  DELL4  ASUS4

## 2) concat() - axis=0, axis1 | join='inner','outer'

In [ ]:
pd.concat([DF1,DF2],axis=0)

    hp   IBM   DELL   ASUS
0  hp0  IBM0  DELL0    NaN
1  hp1  IBM1  DELL1    NaN
2  hp2  IBM2  DELL2    NaN
0  hp2  IBM2  DELL2  ASUS2
1  hp3  IBM3  DELL3  ASUS3
2  hp4  IBM4  DELL4  ASUS4

In [ ]:
pd.concat([DF1,DF2], axis=1)

    hp   IBM   DELL   hp   IBM   DELL   ASUS
0  hp0  IBM0  DELL0  hp2  IBM2  DELL2  ASUS2
1  hp1  IBM1  DELL1  hp3  IBM3  DELL3  ASUS3
2  hp2  IBM2  DELL2  hp4  IBM4  DELL4  ASUS4



*   ignore_index = True

In [ ]:
pd.concat([DF1,DF2],axis=0, ignore_index=True)

    hp   IBM   DELL   ASUS
0  hp0  IBM0  DELL0    NaN
1  hp1  IBM1  DELL1    NaN
2  hp2  IBM2  DELL2    NaN
3  hp2  IBM2  DELL2  ASUS2
4  hp3  IBM3  DELL3  ASUS3
5  hp4  IBM4  DELL4  ASUS4

In [ ]:
pd.concat([DF1,DF2],axis=1, join='inner')

    hp   IBM   DELL   hp   IBM   DELL   ASUS
2  hp2  IBM2  DELL2  hp2  IBM2  DELL2  ASUS2

In [ ]:
pd.concat([DF1,DF2],axis=1, join='outer')

    hp   IBM   DELL   hp   IBM   DELL   ASUS
0  hp0  IBM0  DELL0  NaN   NaN    NaN    NaN
1  hp1  IBM1  DELL1  NaN   NaN    NaN    NaN
2  hp2  IBM2  DELL2  hp2  IBM2  DELL2  ASUS2
3  NaN   NaN    NaN  hp3  IBM3  DELL3  ASUS3
4  NaN   NaN    NaN  hp4  IBM4  DELL4  ASUS4

## 3) merge(DF1, DF2, how = 'inner', 'outer', 'left', 'right')

In [ ]:
pd.merge(DF1,DF2)

    hp   IBM   DELL   ASUS
0  hp2  IBM2  DELL2  ASUS2

In [ ]:
pd.merge(DF1,DF2, how='outer')

    hp   IBM   DELL   ASUS
0  hp0  IBM0  DELL0    NaN
1  hp1  IBM1  DELL1    NaN
2  hp2  IBM2  DELL2  ASUS2
3  hp3  IBM3  DELL3  ASUS3
4  hp4  IBM4  DELL4  ASUS4

In [ ]:
pd.merge(DF1, DF2, how='left')

    hp   IBM   DELL   ASUS
0  hp0  IBM0  DELL0    NaN
1  hp1  IBM1  DELL1    NaN
2  hp2  IBM2  DELL2  ASUS2

In [ ]:
pd.merge(DF1,DF2, how='right')

    hp   IBM   DELL   ASUS
0  hp2  IBM2  DELL2  ASUS2
1  hp3  IBM3  DELL3  ASUS3
2  hp4  IBM4  DELL4  ASUS4

# 5, 그룹 연산

## 1) 실습용 'titanic' 데이터 셋

In [91]:
import seaborn as sns
titanic = sns.load_dataset('titanic')

DF=titanic.loc[:,['age','sex','class','fare','survived']]
DF.head()

    age     sex  class     fare  survived
0  22.0    male  Third   7.2500         0
1  38.0  female  First  71.2833         1
2  26.0  female  Third   7.9250         1
3  35.0  female  First  53.1000         1
4  35.0    male  Third   8.0500         0

## 2) groupby()

In [92]:
grouped = DF.groupby(['class'])
grouped

* groupby 결과 확인(3개 그룹)
  * 'First', 'Second', 'Third' 키별로 3줄씩 출력
  * .get_group('Key_Name')

In [ ]:
for key in ['First','Second','Third']:
  print(grouped.get_group(key).head(3))
  print('\n')

    age     sex  class     fare  survived
1  38.0  female  First  71.2833         1
3  35.0  female  First  53.1000         1
6  54.0    male  First  51.8625         0


     age     sex   class     fare  survived
9   14.0  female  Second  30.0708         1
15  55.0  female  Second  16.0000         1
17   NaN    male  Second  13.0000         1


    age     sex  class   fare  survived
0  22.0    male  Third  7.250         0
2  26.0  female  Third  7.925         1
4  35.0    male  Third  8.050         0

In [ ]:
grouped.get_group('First').head(3)

    age     sex  class     fare  survived
1  38.0  female  First  71.2833         1
3  35.0  female  First  53.1000         1
6  54.0    male  First  51.8625         0

In [ ]:
grouped.mean()

              age       fare  survived
class
First   38.233441  84.154687  0.629630
Second  29.877630  20.662183  0.472826
Third   25.140620  13.675550  0.242363

In [93]:
grouped_TWO = DF.groupby(['class','sex'])
grouped_TWO

In [ ]:
# key = 열 별, group = 행(값) 별
for key, group in grouped_TWO:
  print('* key : ', key)
  print('*number : ', len(group))
  print(group.head(3))
  print('\n')

* key :  ('First', 'female')
*number :  94
     age     sex  class     fare  survived
1   38.0  female  First  71.2833         1
3   35.0  female  First  53.1000         1
11  58.0  female  First  26.5500         1


* key :  ('First', 'male')
*number :  122
     age   sex  class      fare  survived
6   54.0  male  First   51.8625         0
23  28.0  male  First   35.5000         1
27  19.0  male  First  263.0000         0


* key :  ('Second', 'female')
*number :  76
     age     sex   class     fare  survived
9   14.0  female  Second  30.0708         1
15  55.0  female  Second  16.0000         1
41  27.0  female  Second  21.0000         0


* key :  ('Second', 'male')
*number :  108
     age   sex   class  fare  survived
17   NaN  male  Second  13.0         1
20  35.0  male  Second  26.0         0
21  34.0  male  Second  13.0         1


* key :  ('Third', 'female')
*number :  144
     age     sex  class     fare  survived
2   26.0  female  Third   7.9250         1
8   27.0  female  Third  11.1333         1
10   4.0  female  Third  16.7000         1


* key :  ('Third', 'male')
*number :  347
    age   sex  class    fare  survived
0  22.0  male  Third  7.2500         0
4  35.0  male  Third  8.0500         0
5   NaN  male  Third  8.4583         0

In [ ]:
grouped_TWO.mean()

                     age        fare  survived
class  sex
First  female  34.611765  106.125798  0.968085
       male    41.281386   67.226127  0.368852
Second female  28.722973   21.970121  0.921053
       male    30.740707   19.741782  0.157407
Third  female  21.750000   16.118810  0.500000
       male    26.507589   12.661633  0.135447

In [ ]:
grouped_TWO.get_group(('First','female')).head(3)

     age     sex  class     fare  survived
1   38.0  female  First  71.2833         1
3   35.0  female  First  53.1000         1
11  58.0  female  First  26.5500         1

## 3) agg() <p> - Aggregation : 여러개의 함수를 groupby 객체에 적용

In [ ]:
grouped.agg(['mean','std'])

              age                  fare             survived
             mean        std       mean        std      mean       std
class
First   38.233441  14.802856  84.154687  78.380373  0.629630  0.484026
Second  29.877630  14.001077  20.662183  13.417399  0.472826  0.500623
Third   25.140620  12.495398  13.675550  11.778142  0.242363  0.428949

In [ ]:
grouped_TWO.agg(['mean','std'])

                     age                   fare             survived
                    mean        std        mean        std      mean       std
class  sex
First  female  34.611765  13.612052  106.125798  74.259988  0.968085  0.176716
       male    41.281386  15.139570   67.226127  77.548021  0.368852  0.484484
Second female  28.722973  12.872702   21.970121  10.891796  0.921053  0.271448
       male    30.740707  14.793894   19.741782  14.922235  0.157407  0.365882
Third  female  21.750000  12.729964   16.118810  11.690314  0.500000  0.501745
       male    26.507589  12.159514   12.661633  11.681696  0.135447  0.342694

In [ ]:
grouped.fare.agg(['min','max'])

        min       max
class
First   0.0  512.3292
Second  0.0   73.5000
Third   0.0   69.5500

In [ ]:
grouped.agg({'fare':['min','max'], 'age':['mean','std']})

       fare                  age
        min       max       mean        std
class
First   0.0  512.3292  38.233441  14.802856
Second  0.0   73.5000  29.877630  14.001077
Third   0.0   69.5500  25.140620  12.495398

## 4) transform()

In [ ]:
DF.head(3)

    age     sex  class     fare  survived
0  22.0    male  Third   7.2500         0
1  38.0  female  First  71.2833         1
2  26.0  female  Third   7.9250         1

In [ ]:
def z_score(x):
  return (x - x.mean())/x.std()

In [ ]:
DF['z_score'] = grouped.survived.transform(z_score)
DF.head()

    age     sex  class     fare  survived   z_score
0  22.0    male  Third   7.2500         0 -0.565014
1  38.0  female  First  71.2833         1  0.765188
2  26.0  female  Third   7.9250         1  1.766263
3  35.0  female  First  53.1000         1  0.765188
4  35.0    male  Third   8.0500         0 -0.565014

In [ ]:
DF['z_score'] = grouped.age.transform(z_score)
DF.head()

    age     sex  class     fare  survived   z_score
0  22.0    male  Third   7.2500         0 -0.251342
1  38.0  female  First  71.2833         1 -0.015770
2  26.0  female  Third   7.9250         1  0.068776
3  35.0  female  First  53.1000         1 -0.218434
4  35.0    male  Third   8.0500         0  0.789041

## 5) filter() - data 200개 이상인 그룹의 결과만 필터링

In [ ]:
grouped.filter(lambda x: len(x)>200).head(3)

    age     sex  class     fare  survived   z_score
0  22.0    male  Third   7.2500         0 -0.251342
1  38.0  female  First  71.2833         1 -0.015770
2  26.0  female  Third   7.9250         1  0.068776

In [ ]:
grouped.apply(len)

class
First     216
Second    184
Third     491
dtype: int64

In [ ]:
grouped.filter(lambda x: x.age.mean()<30).head(3)

    age     sex  class   fare  survived   z_score
0  22.0    male  Third  7.250         0 -0.251342
2  26.0  female  Third  7.925         1  0.068776
4  35.0    male  Third  8.050         0  0.789041

In [ ]:
grouped.age.mean()

class
First     38.233441
Second    29.877630
Third     25.140620
Name: age, dtype: float64

## 6) apply(lambda x: x.describe()/ x.age.mean()<30)

In [94]:
grouped.apply(lambda x: x.describe())

                     age        fare    survived
class
First  count  186.000000  216.000000  216.000000
       mean    38.233441   84.154687    0.629630
       std     14.802856   78.380373    0.484026
       min      0.920000    0.000000    0.000000
       25%     27.000000   30.923950    0.000000
       50%     37.000000   60.287500    1.000000
       75%     49.000000   93.500000    1.000000
       max     80.000000  512.329200    1.000000
Second count  173.000000  184.000000  184.000000
       mean    29.877630   20.662183    0.472826
       std     14.001077   13.417399    0.500623
       min      0.670000    0.000000    0.000000
       25%     23.000000   13.000000    0.000000
       50%     29.000000   14.250000    0.000000
       75%     36.000000   26.000000    1.000000
       max     70.000000   73.500000    1.000000
Third  count  355.000000  491.000000  491.000000
       mean    25.140620   13.675550    0.242363
       std     12.495398   11.778142    0.428949
       min      0.420000    0.000000    0.000000
       25%     18.000000    7.750000    0.000000
       50%     24.000000    8.050000    0.000000
       75%     32.000000   15.500000    0.000000
       max     74.000000   69.550000    1.000000

In [95]:
grouped_TWO.apply(lambda x: x.describe())

                            age        fare    survived
class  sex
First  female count   85.000000   94.000000   94.000000
              mean    34.611765  106.125798    0.968085
              std     13.612052   74.259988    0.176716
              min      2.000000   25.929200    0.000000
              25%     23.000000   57.244800    1.000000
              50%     35.000000   82.664550    1.000000
              75%     44.000000  134.500000    1.000000
              max     63.000000  512.329200    1.000000
       male   count  101.000000  122.000000  122.000000
              mean    41.281386   67.226127    0.368852
              std     15.139570   77.548021    0.484484
              min      0.920000    0.000000    0.000000
              25%     30.000000   27.728100    0.000000
              50%     40.000000   41.262500    0.000000
              75%     51.000000   78.459375    1.000000
              max     80.000000  512.329200    1.000000
Second female count   74.000000   76.000000   76.000000
              mean    28.722973   21.970121    0.921053
              std     12.872702   10.891796    0.271448
              min      2.000000   10.500000    0.000000
              25%     22.250000   13.000000    1.000000
              50%     28.000000   22.000000    1.000000
              75%     36.000000   26.062500    1.000000
              max     57.000000   65.000000    1.000000
       male   count   99.000000  108.000000  108.000000
              mean    30.740707   19.741782    0.157407
              std     14.793894   14.922235    0.365882
              min      0.670000    0.000000    0.000000
              25%     23.000000   12.331250    0.000000
              50%     30.000000   13.000000    0.000000
              75%     36.750000   26.000000    0.000000
              max     70.000000   73.500000    1.000000
Third  female count  102.000000  144.000000  144.000000
              mean    21.750000   16.118810    0.500000
              std     12.729964   11.690314    0.501745
              min      0.750000    6.750000    0.000000
              25%     14.125000    7.854200    0.000000
              50%     21.500000   12.475000    0.500000
              75%     29.750000   20.221875    1.000000
              max     63.000000   69.550000    1.000000
       male   count  253.000000  347.000000  347.000000
              mean    26.507589   12.661633    0.135447
              std     12.159514   11.681696    0.342694
              min      0.420000    0.000000    0.000000
              25%     20.000000    7.750000    0.000000
              50%     25.000000    7.925000    0.000000
              75%     33.000000   10.008300    0.000000
              max     74.000000   69.550000    1.000000

In [96]:
grouped.apply(lambda x:x.age.mean()<30)

class
First     False
Second     True
Third      True
dtype: bool

# 6, 멀티 인덱스

### 1).xs('First', level = 'class')

In [97]:
grouped_MI = DF.groupby(['class','sex'])
grouped_MI.mean()

                     age        fare  survived
class  sex
First  female  34.611765  106.125798  0.968085
       male    41.281386   67.226127  0.368852
Second female  28.722973   21.970121  0.921053
       male    30.740707   19.741782  0.157407
Third  female  21.750000   16.118810  0.500000
       male    26.507589   12.661633  0.135447

In [98]:
grouped_MI.mean().xs('First', level = 'class')

              age        fare  survived
sex
female  34.611765  106.125798  0.968085
male    41.281386   67.226127  0.368852

In [99]:
grouped_MI.mean().xs('female', level='sex')

              age        fare  survived
class
First   34.611765  106.125798  0.968085
Second  28.722973   21.970121  0.921053
Third   21.750000   16.118810  0.500000

In [100]:
grouped_MI.mean().xs(['First','male'],level=['class','sex'])

                  age       fare  survived
class sex
First male  41.281386  67.226127  0.368852

# 7, pivot_table()

## 1) 실습용 'titanic' 데이터셋

In [102]:
import seaborn as sns
titanic = sns.load_dataset('titanic')

DF=titanic.loc[:,['age','sex','class','fare','survived']]
DF.head(3)

    age     sex  class     fare  survived
0  22.0    male  Third   7.2500         0
1  38.0  female  First  71.2833         1
2  26.0  female  Third   7.9250         1

## 2) pivot_table() 구성요소

In [104]:
DF_1 = pd.pivot_table(DF,
                      index='class',
                      columns = 'sex',
                      values='age',
                      aggfunc='mean')
DF_1

sex        female       male
class
First   34.611765  41.281386
Second  28.722973  30.740707
Third   21.750000  26.507589

## 3) 두 개의 적용함수

In [106]:
DF_2 = pd.pivot_table(DF,
                      index='class',
                      columns='sex',
                      values='survived',
                      aggfunc=['mean','sum'])
DF_2

            mean              sum
sex       female      male female male
class
First   0.968085  0.368852     91   45
Second  0.921053  0.157407     70   17
Third   0.500000  0.135447     72   47

## 4) 다중 인덱스, 다중 데이터, 다중 함수

In [110]:
DF_3 = pd.pivot_table(DF,
                      index=['class','sex'],
                      columns='survived',
                      values=['age','fare'],
                      aggfunc=['mean','max'])
DF_3

                    mean                         ...   max
                     age                   fare  ...   age    fare
survived               0          1           0  ...     1       0         1
class  sex                                       ...
First  female  25.666667  34.939024  110.604167  ...  63.0  151.55  512.3292
       male    44.581967  36.248000   62.894910  ...  80.0  263.00  512.3292
Second female  36.000000  28.080882   18.250000  ...  55.0   26.00   65.0000
       male    33.369048  16.022000   19.488965  ...  62.0   73.50   39.0000
Third  female  23.818182  19.329787   19.773093  ...  63.0   69.55   31.3875
       male    27.255814  22.274211   12.204469  ...  45.0   69.55   56.4958

[6 rows x 8 columns]

## 5) 멀티 인덱스 (행/열)

In [111]:
DF_3.index

MultiIndex([( 'First', 'female'),
            ( 'First',   'male'),
            ('Second', 'female'),
            ('Second',   'male'),
            ( 'Third', 'female'),
            ( 'Third',   'male')],
           names=['class', 'sex'])

In [113]:
DF_3.columns

MultiIndex([('mean',  'age', 0),
            ('mean',  'age', 1),
            ('mean', 'fare', 0),
            ('mean', 'fare', 1),
            ( 'max',  'age', 0),
            ( 'max',  'age', 1),
            ( 'max', 'fare', 0),
            ( 'max', 'fare', 1)],
           names=[None, None, 'survived'])

In [114]:
DF_3.xs('First', axis=0)

               mean                         ...   max
                age                   fare  ...   age    fare
survived          0          1           0  ...     1       0         1
sex                                         ...
female    25.666667  34.939024  110.604167  ...  63.0  151.55  512.3292
male      44.581967  36.248000   62.894910  ...  80.0  263.00  512.3292

[2 rows x 8 columns]

In [118]:
DF_3.xs(('First','female'), axis=0)

            survived
mean  age   0            25.666667
            1            34.939024
      fare  0           110.604167
            1           105.978159
max   age   0            50.000000
            1            63.000000
      fare  0           151.550000
            1           512.329200
Name: (First, female), dtype: float64

In [119]:
DF_3.xs('male', level='sex', axis=0)

               mean                        ...   max
                age                  fare  ...   age    fare
survived          0          1          0  ...     1       0         1
class                                      ...
First     44.581967  36.248000  62.894910  ...  80.0  263.00  512.3292
Second    33.369048  16.022000  19.488965  ...  62.0   73.50   39.0000
Third     27.255814  22.274211  12.204469  ...  45.0   69.55   56.4958

[3 rows x 8 columns]

In [120]:
DF_3.xs(('First','male'), level=['class','sex'], axis=0)

                 mean                               max
                  age              fare             age         fare
survived            0       1         0         1     0     1      0         1
class sex
First male  44.581967  36.248  62.89491  74.63732  71.0  80.0  263.0  512.3292

* 열 멀티인덱스

In [121]:
DF_3.xs('mean', axis=1)

                     age                   fare
survived               0          1           0           1
class  sex
First  female  25.666667  34.939024  110.604167  105.978159
       male    44.581967  36.248000   62.894910   74.637320
Second female  36.000000  28.080882   18.250000   22.288989
       male    33.369048  16.022000   19.488965   21.095100
Third  female  23.818182  19.329787   19.773093   12.464526
       male    27.255814  22.274211   12.204469   15.579696

In [122]:
DF_3.xs(('mean','fare'), axis=1)

survived                0           1
class  sex
First  female  110.604167  105.978159
       male     62.894910   74.637320
Second female   18.250000   22.288989
       male     19.488965   21.095100
Third  female   19.773093   12.464526
       male     12.204469   15.579696

In [124]:
DF_3.xs(('max','age',0), level=[0,1,'survived'], axis=1)

                max
                age
survived          0
class  sex
First  female  50.0
       male    71.0
Second female  57.0
       male    70.0
Third  female  48.0
       male    74.0

In [125]:
DF_3.xs(1, level='survived', axis=1)

                    mean               max
                     age        fare   age      fare
class  sex
First  female  34.939024  105.978159  63.0  512.3292
       male    36.248000   74.637320  80.0  512.3292
Second female  28.080882   22.288989  55.0   65.0000
       male    16.022000   21.095100  62.0   39.0000
Third  female  19.329787   12.464526  63.0   31.3875
       male    22.274211   15.579696  45.0   56.4958